In [1]:
import pandas as pd

In [4]:
data = {
    'name' : ['suraj','rajat'],
    'age' : [20,22]
}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

    name  age
0  suraj   20
1  rajat   22

In [7]:
df['gender'] = ['M',"M"]

In [8]:
df

    name  age gender
0  suraj   20      M
1  rajat   22      M

In [9]:
df.insert(1,'l_name',['patil','dhage'])

In [10]:
df

    name l_name  age gender
0  suraj  patil   20      M
1  rajat  dhage   22      M

In [11]:
import pandas as pd

# Creating a DataFrame with missing values
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, None, 40],
    'City': ['New York', 'Los Angeles', None, 'Chicago'],
    'Salary': [70000, 80000, 90000, None]
}
df = pd.DataFrame(data)

print("Original DataFrame with Missing Values:")
print(df)

Original DataFrame with Missing Values:
      Name   Age         City   Salary
0    Alice  25.0     New York  70000.0
1      Bob  30.0  Los Angeles  80000.0
2  Charlie   NaN         None  90000.0
3    David  40.0      Chicago      NaN

In [12]:
# Dropping rows with any missing values
df_dropped_any = df.dropna()

print("\nDataFrame after Dropping Rows with Any Missing Values:")
print(df_dropped_any)

DataFrame after Dropping Rows with Any Missing Values:
    Name   Age         City   Salary
0  Alice  25.0     New York  70000.0
1    Bob  30.0  Los Angeles  80000.0

In [13]:
# Dropping rows with all missing values
df_dropped_all = df.dropna(how='all')

print("\nDataFrame after Dropping Rows with All Missing Values:")
print(df_dropped_all)

DataFrame after Dropping Rows with All Missing Values:
      Name   Age         City   Salary
0    Alice  25.0     New York  70000.0
1      Bob  30.0  Los Angeles  80000.0
2  Charlie   NaN         None  90000.0
3    David  40.0      Chicago      NaN

In [14]:
# Dropping columns with any missing values
df_dropped_columns_any = df.dropna(axis=1)

print("\nDataFrame after Dropping Columns with Any Missing Values:")
print(df_dropped_columns_any)

DataFrame after Dropping Columns with Any Missing Values:
      Name
0    Alice
1      Bob
2  Charlie
3    David

In [15]:
# Dropping columns with all missing values
df_dropped_columns_all = df.dropna(axis=1, how='all')

print("\nDataFrame after Dropping Columns with All Missing Values:")
print(df_dropped_columns_all)

DataFrame after Dropping Columns with All Missing Values:
      Name   Age         City   Salary
0    Alice  25.0     New York  70000.0
1      Bob  30.0  Los Angeles  80000.0
2  Charlie   NaN         None  90000.0
3    David  40.0      Chicago      NaN

In [18]:
lst = [10,10,10,5,6,9,8,5,6,9,8,2]
d = {}

In [19]:
for i in lst:
    if i not in d:
        d[i] = 1
    else:
        d[i] += 1

In [20]:
print(d)

{10: 3, 5: 2, 6: 2, 9: 2, 8: 2, 2: 1}